kylefoxaustin/mcxn947qemu/hw/char/mcxn_lpuart.c
/*
 * NXP MCX N LP_FLEXCOMM / LPUART console model
 *
 * Bit masks and offsets taken verbatim from the MCXN947 CMSIS header
 * (devices/MCXN947/MCXN947_cm33_core0.h).
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/char/mcxn_lpuart.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-properties-system.h"
#include "migration/vmstate.h"

/* --- LPUART core register offsets ------------------------------------------ */
#define LPUART_VERID    0x00  /* RO */
#define LPUART_PARAM    0x04  /* RO */
#define LPUART_GLOBAL   0x08
#define LPUART_PINCFG   0x0C
#define LPUART_BAUD     0x10
#define LPUART_STAT     0x14
#define LPUART_CTRL     0x18
#define LPUART_DATA     0x1C
#define LPUART_MATCH    0x20
#define LPUART_MODIR    0x24
#define LPUART_FIFO     0x28
#define LPUART_WATER    0x2C
#define LPUART_DATARO   0x30  /* RO */
#define LPUART_REIR     0x48  /* Receiver Extended Idle */
#define LPUART_TEIR     0x4C  /* Transmitter Extended Idle */
#define LPUART_HDCR     0x50  /* Half Duplex Control */
#define LPUART_TOCR     0x58  /* Timeout Control */
#define LPUART_TOSR     0x5C  /* Timeout Status */
#define LPUART_TIMEOUT0 0x60  /* Timeout 0..3 (step 4) */
#define LPUART_TIMEOUT3 0x6C

/* --- LP_FLEXCOMM wrapper register offsets ---------------------------------- */
#define LPFLEXCOMM_ISTAT   0xFF4  /* RO */
#define LPFLEXCOMM_PSELID  0xFF8

/* --- Bit masks (CMSIS) ----------------------------------------------------- */
#define STAT_OR     0x00080000u
#define STAT_IDLE   0x00100000u
#define STAT_RDRF   0x00200000u
#define STAT_TC     0x00400000u
#define STAT_TDRE   0x00800000u

#define CTRL_RE     0x00040000u
#define CTRL_TE     0x00080000u
#define CTRL_RIE    0x00200000u
#define CTRL_TCIE   0x00400000u
#define CTRL_TIE    0x00800000u

#define FIFO_RXFE   0x00000008u
#define FIFO_TXFE   0x00000080u
#define FIFO_RXEMPT 0x00400000u
#define FIFO_TXEMPT 0x00800000u

#define GLOBAL_RST  0x00000002u

#define PSELID_PERSEL   0x7u
#define PSELID_LOCK     0x8u
#define PERSEL_LPUART   1u    /* LP_FLEXCOMM_PERIPH_LPUART (CMSIS enum value) */
/*
 * Read-only capability bits in PSELID: a full LP_FLEXCOMM (as FlexComm4 is)
 * advertises LPUART/LPSPI/LPI2C present.  The MCUXpresso SDK gates LPUART_Init
 * on UARTPRESENT via LP_FLEXCOMM_PeripheralIsPresent() — without it the console
 * driver bails before programming BAUD/CTRL and PRINTF silently emits nothing.
 */
#define PSELID_UARTPRESENT  0x10u
#define PSELID_SPIPRESENT   0x20u
#define PSELID_I2CPRESENT   0x40u
#define PSELID_PRESENT_BITS \
    (PSELID_UARTPRESENT | PSELID_SPIPRESENT | PSELID_I2CPRESENT)

/*
 * VERID/PARAM are read by some HALs to size the FIFO.  Values are plausible
 * MCX-class constants; refine against the RM if a HAL ever depends on them.
 */
#define LPUART_VERID_VALUE  0x04010003u
#define LPUART_PARAM_VALUE  0x00000404u  /* TX/RX FIFO depth fields */

/* PERSEL function selections (LP_FLEXCOMM_PERIPH_T, CMSIS enum). */
#define PERSEL_LPSPI    2u
#define PERSEL_LPI2C    3u

/* LP_FLEXCOMM ISTAT (0xFF4) per-function interrupt-pending bits (CMSIS). */
#define ISTAT_UARTTX    0x1u
#define ISTAT_UARTRX    0x2u
#define ISTAT_SPI       0x4u
#define ISTAT_I2CM      0x10u

/* === LPSPI register offsets (PERSEL = 2, master view) ====================== */
#define LPSPI_VERID     0x00  /* RO */
#define LPSPI_PARAM     0x04  /* RO */
#define LPSPI_CR        0x10
#define LPSPI_SR        0x14
#define LPSPI_IER       0x18
#define LPSPI_DER       0x1C
#define LPSPI_CFGR0     0x20
#define LPSPI_CFGR1     0x24
#define LPSPI_CCR       0x40
#define LPSPI_CCR1      0x44
#define LPSPI_FCR       0x58
#define LPSPI_FSR       0x5C  /* RO */
#define LPSPI_TCR       0x60
#define LPSPI_TDR       0x64  /* WO */
#define LPSPI_RSR       0x70  /* RO */
#define LPSPI_RDR       0x74  /* RO */
#define LPSPI_RDROR     0x78  /* RO */

#define LPSPI_CR_MEN    0x1u
#define LPSPI_CR_RST    0x2u
#define LPSPI_CR_RTF    0x100u  /* reset TX FIFO (self-clearing) */
#define LPSPI_CR_RRF    0x200u  /* reset RX FIFO (self-clearing) */
#define LPSPI_SR_TDF    0x1u
#define LPSPI_SR_RDF    0x2u
#define LPSPI_SR_WCF    0x100u
#define LPSPI_SR_FCF    0x200u
#define LPSPI_SR_TCF    0x400u
#define LPSPI_SR_W1C    (LPSPI_SR_WCF | LPSPI_SR_FCF | LPSPI_SR_TCF)
#define LPSPI_IER_TDIE  0x1u
#define LPSPI_IER_RDIE  0x2u
#define LPSPI_TCR_FRAMESZ 0xFFFu
#define LPSPI_TCR_RXMSK 0x80000u
#define LPSPI_RSR_RXEMPTY 0x2u

#define LPSPI_VERID_VALUE  0x01010004u
#define LPSPI_PARAM_VALUE  0x00040404u  /* PCSNUM=4, RX/TX FIFO depth exp=4 */

/* === LPI2C register offsets (PERSEL = 3, controller/master view) =========== */
#define LPI2C_VERID     0x00  /* RO */
#define LPI2C_PARAM     0x04  /* RO */
#define LPI2C_MCR       0x10
#define LPI2C_MSR       0x14
#define LPI2C_MIER      0x18
#define LPI2C_MDER      0x1C
#define LPI2C_MCFGR0    0x20
#define LPI2C_MCFGR1    0x24
#define LPI2C_MCFGR2    0x28
#define LPI2C_MCFGR3    0x2C
#define LPI2C_MCCR0     0x48
#define LPI2C_MCCR1     0x50
#define LPI2C_MFCR      0x58
#define LPI2C_MFSR      0x5C  /* RO */
#define LPI2C_MTDR      0x60  /* WO */
#define LPI2C_MRDR      0x70  /* RO */

#define LPI2C_MCR_MEN   0x1u
#define LPI2C_MCR_RST   0x2u
#define LPI2C_MCR_RTF   0x100u  /* reset TX FIFO (self-clearing) */
#define LPI2C_MCR_RRF   0x200u  /* reset RX FIFO (self-clearing) */
#define LPI2C_MSR_TDF   0x1u
#define LPI2C_MSR_RDF   0x2u
#define LPI2C_MSR_EPF   0x100u
#define LPI2C_MSR_SDF   0x200u
#define LPI2C_MSR_NDF   0x400u
#define LPI2C_MSR_MBF   0x1000000u
#define LPI2C_MSR_BBF   0x2000000u
#define LPI2C_MSR_W1C   (LPI2C_MSR_EPF | LPI2C_MSR_SDF | LPI2C_MSR_NDF)
#define LPI2C_MIER_TDIE 0x1u
#define LPI2C_MIER_RDIE 0x2u
#define LPI2C_MRDR_RXEMPTY 0x4000u
#define LPI2C_MTDR_CMD_SHIFT 8
#define LPI2C_MTDR_CMD_MASK  0x700u
#define LPI2C_MTDR_DATA_MASK 0xFFu
/* MTDR command field [10:8] (CMSIS RM): */
#define LPI2C_CMD_TXDATA   0u   /* transmit DATA byte                    */
#define LPI2C_CMD_RXDATA   1u   /* receive (DATA+1) bytes                */
#define LPI2C_CMD_STOP     2u   /* generate STOP                         */
#define LPI2C_CMD_START    4u   /* generate (re)START + transmit address; 4..7 are START variants */

