kylefoxaustin/mcxn947qemu/hw/char/mcxn_lpuart.c
#define LPI2C_VERID_VALUE  0x01000003u
#define LPI2C_PARAM_VALUE  0x00000202u  /* M TX/RX FIFO depth exp=2 (4 deep) */

/* Dynamic LPSPI status: latched W1C flags plus the always-current TDF/RDF. */
static uint32_t mcxn_lpspi_status(MCXNLPUARTState *s)
{
    uint32_t sr = s->spi_sr;
    if (s->spi_cr & LPSPI_CR_MEN) {
        sr |= LPSPI_SR_TDF;          /* synchronous TX FIFO always has room */
    }
    if (s->spi_rx_full) {
        sr |= LPSPI_SR_RDF;
    }
    return sr;
}

/* Dynamic LPI2C controller status. */
static uint32_t mcxn_lpi2c_status(MCXNLPUARTState *s)
{
    uint32_t msr = s->i2c_msr;
    if (s->i2c_mcr & LPI2C_MCR_MEN) {
        msr |= LPI2C_MSR_TDF;        /* synchronous TX FIFO always has room */
    }
    if (s->i2c_rx_full) {
        msr |= LPI2C_MSR_RDF;
    }
    if (s->i2c_busy) {
        msr |= LPI2C_MSR_MBF | LPI2C_MSR_BBF;
    }
    return msr;
}

/*
 * LP_FLEXCOMM ISTAT (0xFF4): which selected function currently has an enabled
 * interrupt pending.  The single FlexComm NVIC line is the OR of these; the
 * SDK's LP_FLEXCOMM IRQ handler reads ISTAT to dispatch to the sub-driver.
 */
static uint32_t mcxn_flexcomm_istat(MCXNLPUARTState *s)
{
    uint32_t istat = 0;

    switch (s->pselid & PSELID_PERSEL) {
    case PERSEL_LPSPI:
        if (s->spi_ier & mcxn_lpspi_status(s)) {
            istat |= ISTAT_SPI;
        }
        break;
    case PERSEL_LPI2C:
        if (s->i2c_mier & mcxn_lpi2c_status(s)) {
            istat |= ISTAT_I2CM;
        }
        break;
    default: /* LPUART (or NONE) */
        /* TX data-register-empty and transmit-complete are always asserted in
         * this model (writes are synchronous), so TIE/TCIE assert immediately. */
        if (s->ctrl & (CTRL_TIE | CTRL_TCIE)) {
            istat |= ISTAT_UARTTX;
        }
        if ((s->ctrl & CTRL_RIE) && s->rx_full) {
            istat |= ISTAT_UARTRX;
        }
        break;
    }
    return istat;
}

static void mcxn_flexcomm_update_irq(MCXNLPUARTState *s)
{
    qemu_set_irq(s->irq, mcxn_flexcomm_istat(s) != 0);
}

/* === LPSPI (master) function ============================================== */
static uint64_t mcxn_lpspi_read(MCXNLPUARTState *s, hwaddr offset)
{
    switch (offset) {
    case LPSPI_VERID: return LPSPI_VERID_VALUE;
    case LPSPI_PARAM: return LPSPI_PARAM_VALUE;
    case LPSPI_CR:    return s->spi_cr;
    case LPSPI_SR:    return mcxn_lpspi_status(s);
    case LPSPI_IER:   return s->spi_ier;
    case LPSPI_CFGR0: return s->spi_cfgr0;
    case LPSPI_CFGR1: return s->spi_cfgr1;
    case LPSPI_CCR:   return s->spi_ccr;
    case LPSPI_FCR:   return s->spi_fcr;
    case LPSPI_TCR:   return s->spi_tcr;
    case LPSPI_FSR:   return s->spi_rx_full ? (1u << 16) : 0; /* RXCOUNT=1 */
    case LPSPI_RSR:   return s->spi_rx_full ? 0 : LPSPI_RSR_RXEMPTY;
    case LPSPI_RDROR: return s->spi_rdr;                       /* peek, no pop */
    case LPSPI_RDR: {
        uint32_t v = s->spi_rdr;
        if (s->spi_rx_full) {
            s->spi_rx_full = false;
            mcxn_flexcomm_update_irq(s);
        }
        return v;
    }
    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled LPSPI read @0x%03" HWADDR_PRIx
                      "\n", __func__, offset);
        return 0;
    }
}

static void mcxn_lpspi_write(MCXNLPUARTState *s, hwaddr offset, uint32_t value)
{
    switch (offset) {
    case LPSPI_CR:
        if (value & LPSPI_CR_RST) {
            s->spi_cr = s->spi_sr = s->spi_ier = 0;
            s->spi_rx_full = false;
        } else {
            s->spi_cr = value & ~(LPSPI_CR_RTF | LPSPI_CR_RRF);
            if (value & LPSPI_CR_RRF) {
                s->spi_rx_full = false;   /* flush RX FIFO */
            }
            /* RTF: TX FIFO is always empty in this synchronous model. */
        }
        mcxn_flexcomm_update_irq(s);
        break;
    case LPSPI_SR:
        s->spi_sr &= ~(value & LPSPI_SR_W1C);
        mcxn_flexcomm_update_irq(s);
        break;
    case LPSPI_IER:
        s->spi_ier = value;
        mcxn_flexcomm_update_irq(s);
        break;
    case LPSPI_CFGR0: s->spi_cfgr0 = value; break;
    case LPSPI_CFGR1: s->spi_cfgr1 = value; break;
    case LPSPI_CCR:   s->spi_ccr = value;   break;
    case LPSPI_FCR:   s->spi_fcr = value;   break;
    case LPSPI_TCR:   s->spi_tcr = value;   break;
    case LPSPI_CCR1:
    case LPSPI_DER:
        break;  /* accepted, not modelled */
    case LPSPI_TDR:
        /*
         * Master transmit: shift one word out.  With no external device the
         * word loops straight back into the RX FIFO (a physical MOSI->MISO
         * jumper), so a self-contained master transfer completes and can read
         * its own data back — the same loopback idiom as the FlexCAN/I3C
         * models.  RXMSK in TCR suppresses the receive (write-only transfer).
         */
        if (s->spi_cr & LPSPI_CR_MEN) {
            if (!(s->spi_tcr & LPSPI_TCR_RXMSK)) {
                uint32_t framesz = (s->spi_tcr & LPSPI_TCR_FRAMESZ) + 1; /* bits */
                uint32_t mask = (framesz >= 32) ? 0xFFFFFFFFu
                                                : ((1u << framesz) - 1);
                if (s->spi_bus) {
                    /* Board-to-board: shift the word out over the SSI bus (to a
                     * spi-link -> socket -> peer); MISO comes back from the bus. */
                    s->spi_rdr = ssi_transfer(s->spi_bus, value & mask) & mask;
                } else {
                    /* Self-contained loopback (MOSI->MISO jumper). */
                    s->spi_rdr = value & mask;
                }
                s->spi_rx_full = true;
            }
            s->spi_sr |= LPSPI_SR_WCF | LPSPI_SR_FCF | LPSPI_SR_TCF;
            mcxn_flexcomm_update_irq(s);
        }
        break;
    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled LPSPI write @0x%03" HWADDR_PRIx
                      " = 0x%08x\n", __func__, offset, value);
        break;
    }
}

/* === LPI2C (controller/master) function =================================== */
static uint64_t mcxn_lpi2c_read(MCXNLPUARTState *s, hwaddr offset)
{
    switch (offset) {
    case LPI2C_VERID:  return LPI2C_VERID_VALUE;
    case LPI2C_PARAM:  return LPI2C_PARAM_VALUE;
    case LPI2C_MCR:    return s->i2c_mcr;
    case LPI2C_MSR:    return mcxn_lpi2c_status(s);
    case LPI2C_MIER:   return s->i2c_mier;
    case LPI2C_MCFGR1: return s->i2c_mcfgr1;
    case LPI2C_MFSR:   return s->i2c_rx_full ? (1u << 16) : 0;  /* RXCOUNT=1 */
    case LPI2C_MRDR: {
        uint32_t v;
        if (s->i2c_rx_full) {
            v = s->i2c_mrdr;
            s->i2c_rx_full = false;
            mcxn_flexcomm_update_irq(s);
        } else {
            v = LPI2C_MRDR_RXEMPTY;
        }
        return v;
    }
    case LPI2C_MCFGR0:
    case LPI2C_MCFGR2:
    case LPI2C_MCFGR3:
    case LPI2C_MCCR0:
    case LPI2C_MCCR1:
    case LPI2C_MFCR:
    case LPI2C_MDER:
        return 0;  /* accepted, not modelled */
    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled LPI2C read @0x%03" HWADDR_PRIx
                      "\n", __func__, offset);
        return 0;
    }
}

