kylefoxaustin/mcxn947qemu/hw/char/mcxn_lpuart.c
static void mcxn_lpi2c_write(MCXNLPUARTState *s, hwaddr offset, uint32_t value)
{
    switch (offset) {
    case LPI2C_MCR:
        if (value & LPI2C_MCR_RST) {
            s->i2c_mcr = s->i2c_msr = s->i2c_mier = 0;
            s->i2c_rx_full = s->i2c_busy = false;
        } else {
            s->i2c_mcr = value & ~(LPI2C_MCR_RTF | LPI2C_MCR_RRF);
            if (value & LPI2C_MCR_RRF) {
                s->i2c_rx_full = false;
            }
        }
        mcxn_flexcomm_update_irq(s);
        break;
    case LPI2C_MSR:
        s->i2c_msr &= ~(value & LPI2C_MSR_W1C);
        mcxn_flexcomm_update_irq(s);
        break;
    case LPI2C_MIER:
        s->i2c_mier = value;
        mcxn_flexcomm_update_irq(s);
        break;
    case LPI2C_MCFGR1: s->i2c_mcfgr1 = value; break;
    case LPI2C_MCFGR0:
    case LPI2C_MCFGR2:
    case LPI2C_MCFGR3:
    case LPI2C_MCCR0:
    case LPI2C_MCCR1:
    case LPI2C_MFCR:
    case LPI2C_MDER:
        break;  /* accepted, not modelled */
    case LPI2C_MTDR: {
        /*
         * Controller command FIFO.  No external I2C bus is modelled; instead a
         * tiny echo target ACKs every address and returns the most recently
         * transmitted byte on a receive command, so a master read-after-write
         * sequence completes deterministically (the FlexCAN/I3C loopback idiom).
         */
        uint32_t cmd = (value & LPI2C_MTDR_CMD_MASK) >> LPI2C_MTDR_CMD_SHIFT;
        uint8_t data = value & LPI2C_MTDR_DATA_MASK;

        if (!(s->i2c_mcr & LPI2C_MCR_MEN)) {
            break;
        }
        switch (cmd) {
        case LPI2C_CMD_START:
        case 5: case 6: case 7:          /* all START + address variants */
            s->i2c_busy = true;          /* target present -> ACK, no NDF */
            break;
        case LPI2C_CMD_TXDATA:
            s->i2c_last_tx = data;       /* echoed back by a receive command */
            break;
        case LPI2C_CMD_RXDATA:
            s->i2c_mrdr = s->i2c_last_tx;
            s->i2c_rx_full = true;
            break;
        case LPI2C_CMD_STOP:
            s->i2c_busy = false;
            s->i2c_msr |= LPI2C_MSR_SDF | LPI2C_MSR_EPF;
            break;
        default:
            break;
        }
        mcxn_flexcomm_update_irq(s);
        break;
    }
    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled LPI2C write @0x%03" HWADDR_PRIx
                      " = 0x%08x\n", __func__, offset, value);
        break;
    }
}

static uint64_t mcxn_lpuart_read(void *opaque, hwaddr offset, unsigned size)
{
    MCXNLPUARTState *s = MCXN_LPUART(opaque);
    uint32_t r = 0;

    /* Wrapper registers are common to every function selection. */
    if (offset == LPFLEXCOMM_PSELID) {
        return s->pselid | PSELID_PRESENT_BITS;
    }
    if (offset == LPFLEXCOMM_ISTAT) {
        return mcxn_flexcomm_istat(s);
    }
    /* Function-select: route to the LPSPI/LPI2C decode when chosen. */
    switch (s->pselid & PSELID_PERSEL) {
    case PERSEL_LPSPI:
        return mcxn_lpspi_read(s, offset);
    case PERSEL_LPI2C:
        return mcxn_lpi2c_read(s, offset);
    default:
        break;  /* fall through to the LPUART register map */
    }

    switch (offset) {
    case LPUART_VERID:
        r = LPUART_VERID_VALUE;
        break;
    case LPUART_PARAM:
        r = LPUART_PARAM_VALUE;
        break;
    case LPUART_GLOBAL:
        r = s->global;
        break;
    case LPUART_PINCFG:
        r = s->pincfg;
        break;
    case LPUART_BAUD:
        r = s->baud;
        break;
    case LPUART_STAT:
        /* TX always ready; RDRF reflects the 1-byte rx holding register. */
        r = STAT_TDRE | STAT_TC;
        if (s->rx_full) {
            r |= STAT_RDRF;
        }
        break;
    case LPUART_CTRL:
        r = s->ctrl;
        break;
    case LPUART_DATA:
    case LPUART_DATARO:
        r = s->rx_byte;
        if (offset == LPUART_DATA && s->rx_full) {
            s->rx_full = false;
            mcxn_flexcomm_update_irq(s);
            /* The holding register is free again — tell the chardev to resume
             * delivering buffered input, or a continuous RX stream stalls after
             * one byte (can_rx returned 0 under flow control). */
            qemu_chr_fe_accept_input(&s->chr);
        }
        break;
    case LPUART_MATCH:
        r = s->match;
        break;
    case LPUART_MODIR:
        r = s->modir;
        break;
    case LPUART_FIFO:
        r = s->fifo | FIFO_TXEMPT;
        if (!s->rx_full) {
            r |= FIFO_RXEMPT;
        }
        break;
    case LPUART_WATER:
        r = s->water;
        break;
    case LPUART_REIR:
        r = s->reir;
        break;
    case LPUART_TEIR:
        r = s->teir;
        break;
    case LPUART_HDCR:
        r = s->hdcr;
        break;
    case LPUART_TOCR:
        r = s->tocr;
        break;
    case LPUART_TOSR:
        r = s->tosr;
        break;
    case LPUART_TIMEOUT0 ... LPUART_TIMEOUT3:
        r = s->timeout[(offset - LPUART_TIMEOUT0) >> 2];
        break;
    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled read @0x%03" HWADDR_PRIx "\n",
                      __func__, offset);
        break;
    }
    return r;
}

static void mcxn_lpuart_write(void *opaque, hwaddr offset,
                              uint64_t value, unsigned size)
{
    MCXNLPUARTState *s = MCXN_LPUART(opaque);
    uint8_t ch;

    /* Wrapper registers are common to every function selection. */
    if (offset == LPFLEXCOMM_PSELID) {
        s->pselid = value & (PSELID_PERSEL | PSELID_LOCK);
        return;
    }
    if (offset == LPFLEXCOMM_ISTAT) {
        return;  /* read-only */
    }
    /* Function-select: route to the LPSPI/LPI2C decode when chosen. */
    switch (s->pselid & PSELID_PERSEL) {
    case PERSEL_LPSPI:
        mcxn_lpspi_write(s, offset, value);
        return;
    case PERSEL_LPI2C:
        mcxn_lpi2c_write(s, offset, value);
        return;
    default:
        break;  /* fall through to the LPUART register map */
    }

    switch (offset) {
    case LPUART_GLOBAL:
        s->global = value;
        if (value & GLOBAL_RST) {
            /* Software reset: clear the model's writable state. */
            s->ctrl = s->baud = s->fifo = s->water = 0;
            s->rx_full = false;
            mcxn_flexcomm_update_irq(s);
        }
        break;
    case LPUART_PINCFG:
        s->pincfg = value;
        break;
    case LPUART_BAUD:
        s->baud = value;
        break;
    case LPUART_STAT:
        /*
         * STAT is computed on read (TX always ready, RDRF tracks rx).  The
         * write-1-to-clear flag bits the SDK clears here have no standalone
         * model state, so accept and ignore the write.
         */
        break;
    case LPUART_CTRL:
        s->ctrl = value;
        mcxn_flexcomm_update_irq(s);
        break;
    case LPUART_DATA:
        ch = value & 0xFF;
        /* Honour TE: only transmit when the transmitter is enabled. */
        if (s->ctrl & CTRL_TE) {
            qemu_chr_fe_write_all(&s->chr, &ch, 1);
        }
        mcxn_flexcomm_update_irq(s);
        break;
    case LPUART_MATCH:
        s->match = value;
        break;
    case LPUART_MODIR:
        s->modir = value;
        break;
    case LPUART_FIFO:
        s->fifo = value;
        break;
    case LPUART_WATER:
        s->water = value;
        break;
    case LPUART_REIR:
        s->reir = value;
        break;
    case LPUART_TEIR:
        s->teir = value;
        break;
    case LPUART_HDCR:
        s->hdcr = value;
        break;
    case LPUART_TOCR:
        s->tocr = value;
        break;
    case LPUART_TOSR:
        s->tosr = value;
        break;
    case LPUART_TIMEOUT0 ... LPUART_TIMEOUT3:
        s->timeout[(offset - LPUART_TIMEOUT0) >> 2] = value;
        break;
    case LPUART_VERID:
    case LPUART_PARAM:
    case LPUART_DATARO:
        /* read-only */
        break;
    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled write @0x%03" HWADDR_PRIx
                      " = 0x%08x\n", __func__, offset, (uint32_t)value);
        break;
    }
}

