kylefoxaustin/mcxn947qemu/hw/char/mcxn_lpuart.c
static const MemoryRegionOps mcxn_lpuart_ops = {
    .read = mcxn_lpuart_read,
    .write = mcxn_lpuart_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    /*
     * Accept 1/2/4-byte access.  A real driver moving data over eDMA bursts the
     * FIFO data registers (LPUART DATA, LPSPI TDR/RDR) one byte at a time; an
     * over-strict 4-byte-only window would make the memory core SILENTLY DROP
     * those byte writes (transfer "completes" but no data reaches the wire) — a
     * silent-wrong-answer bug (fleet lesson from the i.MX95 LPSPI-over-eDMA
     * case).  impl.min=1 routes each byte straight to the handler (no
     * read-modify-write, so the DATA-read RX side effect is not spuriously
     * triggered by a byte write); the data registers hold their value in the
     * low byte, so aligned byte access is handled correctly.
     */
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

static int mcxn_lpuart_can_rx(void *opaque)
{
    MCXNLPUARTState *s = MCXN_LPUART(opaque);
    /* Accept a byte only when the receiver is enabled and the holding reg is
     * empty (single-entry model). */
    return (s->ctrl & CTRL_RE) && !s->rx_full;
}

static void mcxn_lpuart_rx(void *opaque, const uint8_t *buf, int size)
{
    MCXNLPUARTState *s = MCXN_LPUART(opaque);

    if (size > 0) {
        s->rx_byte = buf[0];
        s->rx_full = true;
        mcxn_flexcomm_update_irq(s);
    }
}

static void mcxn_lpuart_reset(DeviceState *dev)
{
    MCXNLPUARTState *s = MCXN_LPUART(dev);

    s->global = s->pincfg = s->baud = s->ctrl = 0;
    s->match = s->modir = s->fifo = s->water = 0;
    s->pselid = PERSEL_LPUART;   /* default selection for a console instance */
    s->reir = s->teir = s->hdcr = s->tocr = s->tosr = 0;
    s->timeout[0] = s->timeout[1] = s->timeout[2] = s->timeout[3] = 0;
    s->rx_byte = 0;
    s->rx_full = false;

    /* LPSPI / LPI2C function state. */
    s->spi_cr = s->spi_sr = s->spi_ier = 0;
    s->spi_cfgr0 = s->spi_cfgr1 = s->spi_ccr = s->spi_fcr = s->spi_tcr = 0;
    s->spi_rdr = 0;
    s->spi_rx_full = false;
    s->i2c_mcr = s->i2c_msr = s->i2c_mier = s->i2c_mcfgr1 = 0;
    s->i2c_mrdr = 0;
    s->i2c_rx_full = s->i2c_busy = false;
    s->i2c_last_tx = 0;
}

static void mcxn_lpuart_realize(DeviceState *dev, Error **errp)
{
    MCXNLPUARTState *s = MCXN_LPUART(dev);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &mcxn_lpuart_ops, s,
                          TYPE_MCXN_LPUART, 0x1000);
    sysbus_init_mmio(sbd, &s->iomem);
    sysbus_init_irq(sbd, &s->irq);

    qemu_chr_fe_set_handlers(&s->chr, mcxn_lpuart_can_rx, mcxn_lpuart_rx,
                             NULL, NULL, s, NULL, true);

    /* Board-to-board LPSPI node: expose a named SSI bus so a `spi-link`
     * peripheral can bridge this FlexComm's LPSPI to a chardev socket. */
    if (s->spi_bus_name) {
        s->spi_bus = ssi_create_bus(dev, s->spi_bus_name);
    }
}

static const VMStateDescription vmstate_mcxn_lpuart = {
    .name = TYPE_MCXN_LPUART,
    .version_id = 2,
    .minimum_version_id = 2,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(global, MCXNLPUARTState),
        VMSTATE_UINT32(pincfg, MCXNLPUARTState),
        VMSTATE_UINT32(baud, MCXNLPUARTState),
        VMSTATE_UINT32(ctrl, MCXNLPUARTState),
        VMSTATE_UINT32(match, MCXNLPUARTState),
        VMSTATE_UINT32(modir, MCXNLPUARTState),
        VMSTATE_UINT32(fifo, MCXNLPUARTState),
        VMSTATE_UINT32(water, MCXNLPUARTState),
        VMSTATE_UINT32(pselid, MCXNLPUARTState),
        VMSTATE_UINT32(reir, MCXNLPUARTState),
        VMSTATE_UINT32(teir, MCXNLPUARTState),
        VMSTATE_UINT32(hdcr, MCXNLPUARTState),
        VMSTATE_UINT32(tocr, MCXNLPUARTState),
        VMSTATE_UINT32(tosr, MCXNLPUARTState),
        VMSTATE_UINT32_ARRAY(timeout, MCXNLPUARTState, 4),
        VMSTATE_UINT8(rx_byte, MCXNLPUARTState),
        VMSTATE_BOOL(rx_full, MCXNLPUARTState),
        /* LPSPI function */
        VMSTATE_UINT32(spi_cr, MCXNLPUARTState),
        VMSTATE_UINT32(spi_sr, MCXNLPUARTState),
        VMSTATE_UINT32(spi_ier, MCXNLPUARTState),
        VMSTATE_UINT32(spi_cfgr0, MCXNLPUARTState),
        VMSTATE_UINT32(spi_cfgr1, MCXNLPUARTState),
        VMSTATE_UINT32(spi_ccr, MCXNLPUARTState),
        VMSTATE_UINT32(spi_fcr, MCXNLPUARTState),
        VMSTATE_UINT32(spi_tcr, MCXNLPUARTState),
        VMSTATE_UINT32(spi_rdr, MCXNLPUARTState),
        VMSTATE_BOOL(spi_rx_full, MCXNLPUARTState),
        /* LPI2C function */
        VMSTATE_UINT32(i2c_mcr, MCXNLPUARTState),
        VMSTATE_UINT32(i2c_msr, MCXNLPUARTState),
        VMSTATE_UINT32(i2c_mier, MCXNLPUARTState),
        VMSTATE_UINT32(i2c_mcfgr1, MCXNLPUARTState),
        VMSTATE_UINT32(i2c_mrdr, MCXNLPUARTState),
        VMSTATE_BOOL(i2c_rx_full, MCXNLPUARTState),
        VMSTATE_BOOL(i2c_busy, MCXNLPUARTState),
        VMSTATE_UINT8(i2c_last_tx, MCXNLPUARTState),
        VMSTATE_END_OF_LIST()
    },
};

static const Property mcxn_lpuart_properties[] = {
    DEFINE_PROP_CHR("chardev", MCXNLPUARTState, chr),
    DEFINE_PROP_STRING("spi-bus-name", MCXNLPUARTState, spi_bus_name),
};

static void mcxn_lpuart_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_lpuart_realize;
    device_class_set_legacy_reset(dc, mcxn_lpuart_reset);
    dc->vmsd = &vmstate_mcxn_lpuart;
    device_class_set_props(dc, mcxn_lpuart_properties);
}

static const TypeInfo mcxn_lpuart_types[] = {
    {
        .name          = TYPE_MCXN_LPUART,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNLPUARTState),
        .class_init    = mcxn_lpuart_class_init,
    },
};

DEFINE_TYPES(mcxn_lpuart_types)
